platformio/platform-ststm32/misc/svd/STM32H745_CM4.svd
        <register>
          <name>DSI_VVSACCR</name>
          <displayName>DSI_VVSACCR</displayName>
          <description>DSI Host video VSA current configuration register</description>
          <addressOffset>0x154</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>VSA</name>
              <description>VSA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DSI_VVBPCCR</name>
          <displayName>DSI_VVBPCCR</displayName>
          <description>DSI Host video VBP current configuration register</description>
          <addressOffset>0x158</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>VBP</name>
              <description>VBP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DSI_VVFPCCR</name>
          <displayName>DSI_VVFPCCR</displayName>
          <description>DSI Host video VFP current configuration register</description>
          <addressOffset>0x15C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>VFP</name>
              <description>VFP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DSI_VVACCR</name>
          <displayName>DSI_VVACCR</displayName>
          <description>DSI Host video VA current configuration register</description>
          <addressOffset>0x160</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>VA</name>
              <description>VA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DSI_WCFGR</name>
          <displayName>DSI_WCFGR</displayName>
          <description>DSI wrapper configuration register</description>
          <addressOffset>0x400</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DSIM</name>
              <description>DSIM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COLMUX</name>
              <description>COLMUX</description>
              <bitOffset>1</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>TESRC</name>
              <description>TESRC</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TEPOL</name>
              <description>TEPOL</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AR</name>
              <description>AR</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VSPOL</name>
              <description>VSPOL</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DSI_WCR</name>
          <displayName>DSI_WCR</displayName>
          <description>DSI wrapper control register</description>
          <addressOffset>0x404</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>COLM</name>
              <description>COLM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SHTDN</name>
              <description>SHTDN</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LTDCEN</name>
              <description>LTDCEN</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DSIEN</name>
              <description>DSIEN</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DSI_WIER</name>
          <displayName>DSI_WIER</displayName>
          <description>DSI wrapper interrupt enable register</description>
          <addressOffset>0x408</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TEIE</name>
              <description>TEIE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ERIE</name>
              <description>ERIE</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLLLIE</name>
              <description>PLLLIE</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLLUIE</name>
              <description>PLLUIE</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RRIE</name>
              <description>RRIE</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DSI_WISR</name>
          <displayName>DSI_WISR</displayName>
          <description>DSI wrapper interrupt and status register</description>
          <addressOffset>0x40C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TEIF</name>
              <description>TEIF</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ERIF</name>
              <description>ERIF</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BUSY</name>
              <description>BUSY</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLLLS</name>
              <description>PLLLS</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLLLIF</name>
              <description>PLLLIF</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLLUIF</name>
              <description>PLLUIF</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RRS</name>
              <description>RRS</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RRIF</name>
              <description>RRIF</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DSI_WIFCR</name>
          <displayName>DSI_WIFCR</displayName>
          <description>DSI wrapper interrupt flag clear register</description>
          <addressOffset>0x410</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CTEIF</name>
              <description>CTEIF</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CERIF</name>
              <description>CERIF</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CPLLLIF</name>
              <description>CPLLLIF</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CPLLUIF</name>
              <description>CPLLUIF</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CRRIF</name>
              <description>CRRIF</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DSI_WPCR0</name>
          <displayName>DSI_WPCR0</displayName>
          <description>DSI wrapper PHY configuration register 0</description>
          <addressOffset>0x418</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>UIX4</name>
              <description>UIX4</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>SWCL</name>
              <description>SWCL</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SWDL0</name>
              <description>SWDL0</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SWDL1</name>
              <description>SWDL1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HSICL</name>
              <description>HSICL</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HSIDL0</name>
              <description>HSIDL0</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HSIDL1</name>
              <description>HSIDL1</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FTXSMCL</name>
              <description>FTXSMCL</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FTXSMDL</name>
              <description>FTXSMDL</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CDOFFDL</name>
              <description>CDOFFDL</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TDDL</name>
              <description>TDDL</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>			
			<field>
              <name>PDEN</name>
              <description>Pull-down enable</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
			<field>
              <name>TCLKPREPEN</name>
              <description>Custom time for tCLK-PREPARE enable</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
			<field>
              <name>TCLKZEROEN</name>
              <description>Custom time for tCLK-ZERO enable</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
			<field>
              <name>THSPREPEN</name>
              <description>Custom time for tHS-PREPARE enable</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
			<field>
              <name>THSTRAILEN</name>
              <description>Custom time for tHS-TRAIL enable</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
			<field>
              <name>THSZEROEN</name>
              <description>Custom time for tHS-ZERO enable</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
			<field>
              <name>TLPXDEN</name>
              <description>Custom time for tLPX for data lanes enable</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
			<field>
              <name>THSEXITEN</name>
              <description>Custom time for tHS-EXIT enable</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
			<field>
              <name>TLPXCEN</name>
              <description>Custom time for tLPX for clock lane enable</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
			<field>
              <name>TCLKPOSTEN</name>
              <description>Custom time for tCLK-POST enable</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>									
          </fields>
        </register>
        <register>
          <name>DSI_WPCR1</name>
          <displayName>DSI_WPCR1</displayName>
          <description>This register shall be programmed only when DSI is stopped (CR. DSIEN=0 and CR.EN = 0).</description>
          <addressOffset>0x41C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HSTXDCL</name>
              <description>High-speed transmission delay on clock lane</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>HSTXDDL</name>
              <description>High-speed transmission delay on data lanes</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>LPSRCCL</name>
              <description>Low-power transmission slew-rate compensation on clock lane</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>LPSRCDL</name>
              <description>Low-power transmission slew-rate compensation on data lanes</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SDDC</name>
              <description>SDD control</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>           
            <field>
              <name>HSTXSRCCL</name>
              <description>High-speed transmission slew-rate control on clock lane</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>            
            <field>
              <name>HSTXSRCDL</name>
              <description>High-speed transmission slew-rate control on data lanes</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>FLPRXLPM</name>
              <description>Forces LP receiver in low-power mode</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
			<field>
              <name>LPRXFT</name>
              <description>Low-power RX low-pass filtering tuning</description>
              <bitOffset>25</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
		<register>
          <name>DSI_WPCR2</name>
          <displayName>DSI_WPCR2</displayName>
          <description>DSI wrapper PHY configuration register 2</description>
          <addressOffset>0x420</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TCLKPREP</name>
              <description>TCLKPREP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>TCLKZERO</name>
              <description>TCLKZERO</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>			
			<field>
              <name>THSPREP</name>
              <description>THSPREP</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>THSTRAIL</name>
              <description>THSTRAIL</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DSI_WPCR3</name>
          <displayName>DSI_WPCR3</displayName>
          <description>DSI wrapper PHY configuration register 3</description>
          <addressOffset>0x424</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>THSZERO</name>
              <description>THSZERO</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>TLPXD</name>
              <description>TLPXD</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>			
			<field>
              <name>THSEXIT</name>
              <description>THSEXIT</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>TLPXC</name>
              <description>TLPXC</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DSI_WPCR4</name>
          <displayName>DSI_WPCR4</displayName>
          <description>DSI wrapper PHY configuration register 4</description>
          <addressOffset>0x428</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TCLKPOST</name>
              <description>TCLKPOST</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DSI_WRPCR</name>
          <displayName>DSI_WRPCR</displayName>
          <description>DSI wrapper regulator and PLL control register</description>
          <addressOffset>0x430</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PLLEN</name>
              <description>PLLEN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NDIV</name>
              <description>NDIV</description>
              <bitOffset>2</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
            <field>
              <name>IDF</name>
              <description>IDF</description>
              <bitOffset>11</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>ODF</name>
              <description>ODF</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>REGEN</name>
              <description>REGEN</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>					          
